  export const FAQData = [
     {
          id: 1,
          title: "কোর্সটি করার জন্য আগে থেকে কি কি জানতে হবে?",
          paragraph: "কোর্সটি করার জন্য সর্বপ্রথম যা থাকতে হবে তা হল রিডিং হ্যাবিট - বিস্তারিত কিছু লিখে দেয়া থাকলে সেগুলো পুরোটা মনোযোগ সহকারে পড়ার অভ্যাস থাকতে হবে। এছাড়া বেসিক এইচ.টি.এম.এল, সি.এস.এস, বেসিক জাভাস্ক্রিপ্ট, মডার্ন (>=ES6) জাভাস্ক্রিপ্ট, DOM, টেইলউইন্ড সিএসএস, npm, Git/GitHub সম্পর্কে ধারণা এবং VSCode এডিটরে কাজ করার অভিজ্ঞতা থাকতে হবে। বিস্তারিত এখান থেকে জানুন।"
     },
     {
          id: 2,
          title: " কোর্সের প্রথম ক্লাস কবে থেকে শুরু হবে?",
          paragraph: " কোর্সের প্রথম ক্লাস শুরু হবে জানুয়ারি 08, 2024 তারিখ রাত 11:59 মিনিট থেকে। এই সময় থেকে প্রতি সপ্তাহে এক থেকে দুইটি করে মডিউল রিলিজ দেয়া হবে।"
     },
     {
          id: 3,
          title: " কোর্সের ভিডিওগুলো কিভাবে দেয়া হবে?",
          paragraph: "কোর্সের ভিডিওগুলো আগে থেকে রেকোর্ডেড থাকবে। আপনি এনরোল করার পর আপনাকে দেয়া লগইন ইনফরমেশন দিয়ে লগইন করে আপনি ভিডিও গুলো যথা সময়ে দেখতে পারবেন। প্রতি সপ্তাহে 1-2টি মডিউল রিলিজ দেয়া হবে এবং প্রতিটি মডিউলে 10-12টি ভিডিও থাকবে। এই ভিডিওগুলো আপনাকে সপ্তাহের প্রথম 5 দিনের মধ্যে দেখা শেষ করতে হবে যেন বাকি 2 দিনে মডিউল শেষে দেয়া এসাইনমেন্ট করে জমা দিতে পারেন। তবে আপনি যদি ভিডিওগুলো স্বল্প সময়ে দেখে ফেলতে পারেন তাহলে এসাইনমেন্টের জন্য সময় বেশি পাবেন। "
     },
     {
          id: 4,
          title: "কোর্সের পরীক্ষাগুলোতে কিভাবে অংশগ্রহণ করবেন? ",
          paragraph: " প্রতিটি ভিডিওর সাথে কুইজ থাকবে এবং নিজের প্রগরেস বুঝার জন্য আপনাকে কুইজগুলোর উত্তর দিতে হবে। এছাড়া প্রতিটি মডিউল শেষে একটি করে ছোট/বড়/মাঝারি এসাইনমেন্ট থাকবে এবং আপনাদেরকে 36 ঘণ্টার মধ্যে এসাইনমেন্ট করে সোর্স কোড আমাদের গিটহাব ক্লাসরুম থেকে তৈরী করা প্রাইভেট গিটহাব রিপোসিটরি লিঙ্ক জমা দিতে হবে। এছাড়া পুরো কোর্স এর একদম শেষে একটি ফাইনাল পরীক্ষা নেয়া হবে অনলাইনে। সব এসাইনমেন্ট এবং ফাইনাল পরীক্ষার প্রাপ্ত নম্বর যোগ করে ফাইনাল রেজাল্ট নির্ধারণ করা হবে। এসাইনমেন্ট কিভাবে জমা দিবেন সেটা বিস্তারিত জানার জন্য আমাদের এই টিউটোরিয়ালটি ফলো করতে পারেন।   "
     },
     {
          id: 5,
          title: " কোর্সটি কতদিন চলবে?",
          paragraph: " কোর্সটি 1৫ সপ্তাহ মানে প্রায় সাড়ে তিন মাস চলবে। কোন রকম বড় ধরণের দূর্যোগ বা অনিবার্য পরিস্থিতি তৈরী হলে কোর্স ডিউরেশন কিছুদিন বাড়তে পারে।"
     },
     {
          id: 6,
          title: " কোর্সটি করতে আপনার কি কি থাকা লাগবে?",
          paragraph: " সবার প্রথমে প্রয়োজন হবে আপনার ডেডিকেটেড সময় এবং আন্তরিক পরিশ্রম ও অধ্যবসায়। যদি আপনি এগুলো দিতে না পারেন, তাহলে এই কোর্সে এনরোল করে আপনার কোন লাভ হবেনা। এছাড়া আপনার প্রয়োজন হবে একটি ল্যাপটপ বা কম্পিউটার যেখানে Google Chrome ব্রাউজার, Node.js এবং VS Code এডিটর ইন্সটল করা থাকতে হবে। সবগুলো টুলের লেটেস্ট ভার্সন আপনার কম্পিউটারে ইন্সটল করা থাকতে হবে। এরপরে আপনার প্রয়োজন হবে কমপক্ষে ২-১০ এম.বি.পি.এস এর ইন্টারনেট কানেকশন। ব্রডব্যান্ড ইন্টারনেট কানেকশন হলে ভাল হয় তাহলে ভিডিওগুলো ভালভাবে দেখতে পারবেন। আপনি চাইলে মোবাইল ব্রাউজার থেকে ভিডিও গুলো দেখতে পারেন কিন্তু সেটা আমরা কখনোই রেকোমেন্ড করিনা কারণ শেখার সাথে সাথে আসল কোড এডিটরে কোড করা অনেক গুরুত্বপূর্ণ যেটা মোবাইল ব্রাউজারে কখনোই ভালভাবে করা হয়ে উঠেনা। এছাড়া কোর্সের সকল সাপোর্ট আমাদের প্রাইভেট ডিসকোর্ড চ্যানেলে দেয়া হবে। তাই আপনার অবশ্যই একটি ডিসকোর্ড একাউন্টের প্রয়োজন হবে এবং এনরোল করার সময় আপনার ডিসকোর্ড ইউজারনেমটি দিতে হবে যেন আমরা সেই ইউজারনেমটিকে আমাদের সাপোর্ট চ্যানেলে এক্সেস দিতে পারি।"
     },
     {
          id: 7,
          title: " কোর্স ফি কতো?",
          paragraph: " আমাদের রিয়্যাক্টিভ এক্সিলারেটর - কোর্সটির ফি নির্ধারণ করা হয়েছে এককালীন 5,000 টাকা মাত্র। তবে এনরোলমেন্টের সময় আপনি যদি বাংলাদেশি মোবাইল নাম্বার ব্যবহার না করে অন্য মোবাইল নাম্বার ব্যবহার করেন তাহলে কোর্স ফি হবে এককালীন 5,100 টাকা।   "
     },
     {
          id: 8,
          title: " কোর্স ফি কি কোর্সের আগে একবারে পুরোটা পরিশোধ করতে হবে?",
          paragraph: "হ্যাঁ। কোর্স ফি এককালীন একবারে পুরোটাই কোর্সের শুরুতে পরিশোধ করে দিতে হবে। শুধুমাত্র কোর্স ফি পরিশোধ করার পরই আপনাদের কে লগইন ইনফরমেশন দেয়া হবে। কোন ভাবেই কোর্স ফি বাকি রাখা অথবা এসম্পর্কিত অনুরোধ গৃহীত হবেনা। "
     },
]
















